namespace EasilyNET.Tools;

internal static class Constellations
{
    /**
     * | 图标 | 名称   | 英文名      | 日期                      |
     * | --- | ------ | ---------- | ------------------------- |
     * | ♈   | 白羊座 | Aries       | 3 月 21 日~4 月 19 日     |
     * | ♉   | 金牛座 | Taurus      | 4 月 20 日～ 5 月 20 日   |
     * | ♊   | 双子座 | Gemini      | 5 月 21 日～ 6 月 21 日   |
     * | ♋   | 巨蟹座 | Cancer      | 6 月 22 日～ 7 月 22 日   |
     * | ♌   | 狮子座 | Leo         | 7 月 23 日～ 8 月 22 日   |
     * | ♍   | 处女座 | Virgo       | 8 月 23 日～ 9 月 22 日   |
     * | ♎   | 天秤座 | Libra       | 9 月 23 日～ 10 月 23 日  |
     * | ♏   | 天蝎座 | Scorpio     | 10 月 24 日～ 11 月 22 日 |
     * | ♐   | 射手座 | Sagittarius | 11 月 23 日～ 12 月 21 日 |
     * | ♑   | 摩羯座 | Capricorn   | 12 月 22 日～ 1 月 19 日  |
     * | ♒   | 水瓶座 | Aquarius    | 1 月 20 日～ 2 月 18 日   |
     * | ♓   | 双鱼座 | Pisces      | 2 月 19 日～ 3 月 20 日   |
     */
    public static string[] ConstellationConfig { get; } = { "摩羯座", "水瓶座", "双鱼座", "白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座" };
}